{
  "SmallProjects": [
    {
      "ProjectTitle": "VR Exploration and Build",
      "ProjectTopic": "Flexible design process, Spatial rendering, Design exploration, VR user experience",
      "ProjectClient": "A Major GSA Sovereign Fund",
      "ProjectThumbnail": "images/1.cover.png",
      "ProjectVideoPreview": "videos/1.preview.mp4",
      "ProjectMyRole": "The metaverse subject matter expert, in charge of assembling and executing the Research Routine and lead the rapid prototyping process",
      "TeamComposition": "2 Experience designers,\n4 Strategic designers,\n2 Venture architects",
      "ProjectDuration": "6 months",
      "ProjectLocation": "London, Dubai, KSA",
      "ChallengeSummary": "The project was the first-ever immersive technology-built project for the firm.\n\nThe initial goal was to build VR solutions for our target audience, separated from their loved ones over long distances. The team later pivoted the direction to focus on utilizing emerging technology to build a digital community attracting young talents.\n\nWe validated the use case to extend the virtual community concept with a VR onboarding experience for new joiners of our client's community. The project extended from originally a 7-week project to a project lasting more than a year. It is still an ongoing project as of now (OCT 2023). With our strategic input, our client made significant progress in building their own metaverse strategy.",
      "ParagraphContentList": [
        {
          "TitleText": "Intro",
          "SubtitleText": "",
          "ImageLocation": "",
          "ContentText": "Our client faces a unique challenge: Geolocation isolation.\nThey wish to use emerging technologies to help them connect with their loved ones. VR was deemed as a promising technology to help them eliminate the barrier of distance.",
          "Layout": "column"
        },
        {
          "TitleText": "The Initial Problem Statement",
          "SubtitleText": "",
          "ImageLocation": "",
          "ContentText": "How might we help our client, located in a remote location, better connect with each other and their loved ones?",
          "Layout": "statement"
        },
        {
          "TitleText": "Key challenge 1: No prototyping strategies exists",
          "SubtitleText": "",
          "ImageLocation": "",
          "ContentText": "VR prototyping strategies are focusing on gaming experience. There are no existing rapid prototyping methods available for the business validation process we ran.",
          "Layout": "column"
        },
        {
          "TitleText": "Key challenge 2: Designing for VR requires a different digital approach",
          "SubtitleText": "",
          "ImageLocation": "",
          "ContentText": "Building for VR is less about feature focus but creating spaces with a specific purpose in mind, similar to architecture design and spatial design.",
          "Layout": "column"
        },
        {
          "TitleText": "Investigating target user needs and VR desirability",
          "SubtitleText": "15 expert interviews, 40+ in-person VR prototyping sessions, 200+ responses in quantitative research.",
          "ImageLocation": "images/1.1.png",
          "ContentText": "The team started by conducting user interviews. This helped us learn about the user perception of VR technology and their struggle with being separated from their loved ones.",
          "Layout": "column"
        },
        {
          "TitleText": "Uncovering the client's business problem: Attracting young talents",
          "SubtitleText": "",
          "ImageLocation": "",
          "ContentText": "We came to realize that one of the reasons why the client wants 'better connections with loved ones' was, in fact, because of their need to make their work environment better for younger employees, so that they can get young generations to commit to their vision and cause.",
          "Layout": "column"
        },
        {
          "TitleText": " The Pivoted Problem Statement",
          "SubtitleText": "",
          "ImageLocation": "",
          "ContentText": "How might we create a digital community that is built to attract a younger audience, which eliminates the alienating effects caused by distance to prospective talents.",
          "Layout": "statement"
        },
        {
          "TitleText": "Articulating the business value of immersion tech",
          "SubtitleText": "Proving the point with guerrilla marketing",
          "ImageLocation": "images/1.2.png",
          "ContentText": "The team's initial hypothesis was that a dedicated digital community could contribute to many fronts of our client's ambition, especially in recruiting and team morale. We used guerrilla marketing tactics to validate the hypothesis before heading into the VR demo build.",
          "Layout": "column"
        },
        {
          "TitleText": "Building VR",
          "SubtitleText": "4 rooms built, 1 as a testing environment, 1 as a demo, and 2 delivered to the client.",
          "ImageLocation": "",
          "ContentText": "The VR rooms have been tested to foster great interaction and conversation within their community.",
          "Layout": "column"
        },
        {
          "TitleText": "The testing room",
          "SubtitleText": "Result after conducting additional 8 VR user interview sessions.",
          "ImageLocation": "images/1.3.png",
          "ContentText": "The room was used for testing and user interview purposes. We learned about the usage of props, digital identities, and how such space could afford genuine interaction.",
          "Layout": "column"
        },
        {
          "TitleText": "The campfire room",
          "SubtitleText": "",
          "ImageLocation": "images/1.4.png",
          "ContentText": "This is a room built for social interactions. The key goal of these rooms is to have various props for users.",
          "Layout": "column"
        },
        {
          "TitleText": "The pillow fort",
          "SubtitleText": "Positive user experience spotted during passive user studies. ",
          "ImageLocation": "images/1.5.png",
          "ContentText": "The pillow fort was a resounding success that surprised many senior stakeholders. The objects were fairly simple: motionless pillows you can drag and place. Despite its simplicity, this is the place where we spot creativity being unleashed as most of the participants enjoy shaping the pillows into different forms while they have plenty of genuine conversation.",
          "Layout": "column"
        },
        {
          "TitleText": "",
          "SubtitleText": "",
          "ImageLocation": "images/1.6.png",
          "ContentText": "Other objects built for simple interactions also received positive feedback, including interactive fondue pots, cinema, interactive fireplace, football arena, and fireworks.",
          "Layout": "column"
        },
        {
          "TitleText": "Pivoting from failure: The Onboarding Room",
          "SubtitleText": "Room built in 5 working days",
          "ImageLocation": "images/1.7.png",
          "ContentText": "The room was built in just 5 working days leveraging all the previous assets we procured. The room was available for our clients to onboard their new starters.",
          "Layout": "column"
        },
        {
          "TitleText": "Capturing the look and feel as forms provide functions",
          "SubtitleText": "",
          "ImageLocation": "images/1.8.png",
          "ContentText": "Different from the usual 2D digital design, the look and feel itself should be regarded as a feature too, and this was accidentally overlooked.",
          "Layout": "column"
        },
        {
          "TitleText": "Key takeaway:",
          "SubtitleText": "",
          "ImageLocation": "",
          "ContentText": "Immersive experiences requires a combination of digital and spatial features and requires a different approach for designers when comparing to digital cases we are used to nowadays",
          "Layout": "statement"
        }
      ]
    },
    {
      "ProjectTitle": "B2B Web App: Disclosure Platform",
      "ProjectTopic": "User experience design, Full stack digital design, User research, Cross functional team, Agile development",
      "ProjectClient": "A global Climate Tech Firm",
      "ProjectThumbnail": "images/2.cover.png",
      "ProjectVideoPreview": "videos/1.preview.mp4",
      "ProjectMyRole": "Leading the workstream design process. Collaborating on product planning. Acting scram master",
      "TeamComposition": "1 experience designer, \n1 business analyst, \n4 Engineers(FE,BE)",
      "ProjectDuration": "4 months",
      "ProjectLocation": "London, Paris",
      "ChallengeSummary": "The project was the first ever sold metaverse project for the firm.\n\nWith our strategic input, our client made significant progress on building their own metaverse strategy.\nWe've had two major pivot during the period of my staffing.\nThe first phase was to explore the VR use case for the family and business setting. The second phase was to explore the feasibility of building VR based virtual community within our client's core social group (Employees and family).The third use case builds on top of the second phase result. We validated the use case to extend the virtual community concept with a VR onboarding experience for new joiners of our client's community. The project extended from originally a 7 weeks project to a project lasting more than an year. It is still an on going project as of now (OCT 2023.)",
      "ParagraphContentList": [
        {
          "TitleText": "Solving a complex B2B problem",
          "SubtitleText": "",
          "ImageLocation": "",
          "ContentText": "Our client's operation requires a lot of manual tasks. Without validation, the manual tasks are causing a large margin of error damaging their reputation with increases the cost to their operation",
          "Layout": "column"
        },
        {
          "TitleText": "Facilitating brain-storming workshops to problem-solve collectively",
          "SubtitleText": "8 work session with clients, 3 major collaborative workshop to problem solve",
          "ImageLocation": "images/2.1.png",
          "ContentText": "The client's operation was extremely complex. It was agreed that the quickest way to build our hypothesis is by collaborating with our clients. We had 3 major problem solving sessions and 8 work sessions to further iron out the details.",
          "Layout": "column"
        },
        {
          "TitleText": "Fostering the agile development set up",
          "SubtitleText": "",
          "ImageLocation": "",
          "ContentText": "Due to the staffing constrains, we have no product managers familiar with the agile process on the case. Designers on this case were the expert closest to the agile framework. I was tasked to build the agile development framework for my workstream.",
          "Layout": "onlyText"
        },
        {
          "TitleText": "Design to minimise human error",
          "SubtitleText": "",
          "ImageLocation": "",
          "ContentText": "Upon learning about the client's operation. We identified that the key issue was the amount of mental calculation involved in the operation causing all of the issues mentioned above. Our hypothesis is that a well built interface for users to interact with data would be the solution.",
          "Layout": "onlyText"
        },
        {
          "TitleText": "",
          "SubtitleText": "",
          "ImageLocation": "images/2.2.png",
          "ContentText": "Task overview to see the remaining tasks",
          "Layout": "column"
        },
        {
          "TitleText": "",
          "SubtitleText": "",
          "ImageLocation": "images/2.3.png",
          "ContentText": "Inviting clients to contribute to the wireframing effort. Non-designers could also have fun!",
          "Layout": "column"
        },
        {
          "TitleText": "",
          "SubtitleText": "",
          "ImageLocation": "images/2.4.png",
          "ContentText": "Help centre to provide contextual assistance",
          "Layout": "column"
        },
        {
          "TitleText": "",
          "SubtitleText": "",
          "ImageLocation": "images/2.5.png",
          "ContentText": "Navigation rework to reflect the user sessions feedback",
          "Layout": "column"
        },
        {
          "TitleText": "",
          "SubtitleText": "",
          "ImageLocation": "images/2.6.png",
          "ContentText": "Carefully crafted panel to include all information in one screen without jumping back and forth.",
          "Layout": "column"
        },
        {
          "TitleText": "User research sessions to validate our deliverables",
          "SubtitleText": "4 user research sessions with over 20 participants ",
          "ImageLocation": "",
          "ContentText": "The result from the user research sessions was resoundingly positive. the users were affirmative that the product we built will solve the issues they are facing. The sessions was documented and sent to the client for future upskilling programme.",
          "Layout": "onlyText"
        }
      ]
    },
    {
      "ProjectTitle": "Financial Advice platform",
      "ProjectTopic": "UX, wireframe, Wealth Management",
      "ProjectClient": "A FTSE 100 Wealth Management Firm",
      "ProjectThumbnail": "images/S1.cover.png",
      "ProjectVideoPreview":"videos/S1.preview.mp4",
      "ProjectMyRole": "Capturing the key elements from product requirements and turn them into wireframes. Creating user flows to help users document their financial behaviour.",
      "TeamComposition": "2 Experience Designers, Team of FE/BE Engineers, 2 Venture Architects,  ",
      "ProjectDuration": "2 months",
      "ProjectLocation": "London",
      "ChallengeSummary":"This is an incubation project in which the BCG team is tasked to build a stadalone app for Hargreaves Lansdown offering financial health check, financial advice, and financial support for UK wide customers.",
      "ParagraphContentList": [
        {
          "TitleText": "Objective: ",
          "SubtitleText": "",
          "ImageLocation": "",
          "ContentText": "Build the best-in-class product to democratize financial advice for a broader UK audience.",
          "Layout":"statement"
        },
        {
          "TitleText": "Strong user need, but no digital product available. ",
          "SubtitleText": "",
          "ImageLocation": "",
          "ContentText": "Initial research suggests that financial advice is highly sought after among HL users but is perceived as an inaccessible, premium offering. The practice of offering financial advice is also heavily regulated, making it difficult for financial advisors to scale. Recognising the situation, the team identified an opportunity to develop a digital service that allows users to self-assess their financial situation and connect with financial advice experts. The product incorporates automation elements into the KYC (Know Your Customer) process to address the scaling issue for financial advisors.",
          "Layout":"column"
        },
        {
          "TitleText": "Proposed journey",
          "SubtitleText": "",
          "ImageLocation": "",
          "ContentText": "Enabling users to better understand their financial status helps them identify suitable financial products and achieve their life goals. We have simplified the journey, taking into account the varying stages of financial well-being individuals find themselves in.",
          "Layout":"column"
        },
        {
          "TitleText": "Problem Statement: ",
          "SubtitleText": "",
          "ImageLocation": "",
          "ContentText": "How might we empower individuals to assess their financial health and guide them towards appropriate financial products and assistance?",
          "Layout":"statement"
        },
        {
          "TitleText": "Shipping the product: An app with glance view of your financial wellbeing",
          "SubtitleText": "",
          "ImageLocation": "images/S1.1.png",
          "ContentText": "The team aims to quickly bring the idea to market. Our market-ready MVP (Minimum Viable Product) build is not integrated with the HL app and focuses on financial advice and key financial well-being status.",
          "Layout":"column"
        },
        {
          "TitleText": "",
          "SubtitleText": "",
          "ImageLocation": "images/S1.2.png",
          "ContentText": "The financial score is calculated based on user input regarding their current assets.",
          "Layout":"column"
        },
        {
          "TitleText": "Testing material: Leveraging design systems to make testing material from wireframes",
          "SubtitleText": "",
          "ImageLocation": "images/S1.3.png",
          "ContentText": "Quick mock-ups were built for testing sessions. The design system was utilised to give wireframes semantic colours, enabling designers to test the user experience flow with participants before finalising the user interface.",
          "Layout":"column"
        },
        {
          "TitleText": "A/B testing",
          "SubtitleText": "",
          "ImageLocation": "images/S1.4.png",
          "ContentText": "The team completed A/B testing at an incredible pace, facilitated by strong communication and an agile-lean approach.",
          "Layout":"column"
        },
        {
          "TitleText": "",
          "SubtitleText": "",
          "ImageLocation": "images/S1.5.png",
          "ContentText": "The team underwent a robust UX research process before finalising the wireframes for the UI (User Interface) fine finish. On average, the flows underwent three iterations with input from user testing before being sent to UI designers for the final touches.",
          "Layout":"column"
        },
        {
          "TitleText": "",
          "SubtitleText": "",
          "ImageLocation": "images/S1.6.png",
          "ContentText": "After rounds of testing, complicated flows were simplified. The team replicated the effort and built wireframes in tight sprints",
          "Layout":"column"
        }
      ]
    },
    {
      "ProjectTitle": "Wealth Management Gen AI",
      "ProjectTopic": "User experience design, GenAI, Wealth Management",
      "ProjectClient": "Multiple Major Wealth Management Firm across London, Belgium and Netherlands",
      "ProjectThumbnail": "images/S2.cover.png",
      "ProjectVideoPreview": "videos/S2.preview.mp4",
      "ProjectMyRole": "Leading the ideation of the GenAI product to prospective clients. Designing concept prototypes for story telling sessions.",
      "TeamComposition": "Please Fill",
      "ProjectDuration": "2 weeks",
      "ProjectLocation": "Please Fill",
      "ChallengeSummary": "Capturing the essence of the Gen AI impact towards the wealth management industry. Speculating the potential application of the GenAI technology and contribute as the digital expert on the team and provide tech analytics towards potential implementation.",
      "ParagraphContentList": [
        {
          "TitleText": "",
          "SubtitleText": "",
          "ImageLocation": "images/S2.1.png",
          "ContentText": "Using Gen AI to generate scenarios that effectively makes the future projection more relatable and tangible.",
          "Layout": "column"
        },
        {
          "TitleText": "",
          "SubtitleText": "",
          "ImageLocation": "images/S2.2.png",
          "ContentText": "Gen AI creating relevant prompts as potential financial actions for the users to decided the best course of actions towards their goals",
          "Layout": "column"
        },
        {
          "TitleText": "",
          "SubtitleText": "",
          "ImageLocation": "images/S2.3.png",
          "ContentText": "Super charge the financial advisor's ability to better document their customers with Gen AI assisted in their KYC process",
          "Layout": "column"
        },
        {
          "TitleText": "",
          "SubtitleText": "",
          "ImageLocation": "images/S2.4.png",
          "ContentText": "Turning the data collected into instant annuity options without delay. As the users go through the KYC process",
          "Layout": "column"
        },
        {
          "TitleText": "",
          "SubtitleText": "",
          "ImageLocation": "images/S2.5.png",
          "ContentText": "Conceptualising the reverse auction market for annuity and how Gen AI powered product can make the process seamless and effortless",
          "Layout": "column"
        },
        {
          "TitleText": "",
          "SubtitleText": "",
          "ImageLocation": "images/S2.6.png",
          "ContentText": "IM dashboard tracking numerous sentiments allowing the managerial users to understand the general trend of their product and potential area for improvement",
          "Layout": "column"
        }
      ]
    },
    {
      "ProjectTitle": "Industrial good Gen AI",
      "ProjectTopic": "User experience design, GenAI, Industrial Goods",
      "ProjectClient": "Major MedTech Company",
      "ProjectThumbnail": "images/S3.cover.png",
      "ProjectVideoPreview": "videos/S3.preview.mp4",
      "ProjectMyRole": "Leading the workstream design process. Collaborating on product planning.",
      "TeamComposition": "Please Fill",
      "ProjectDuration": "3 weeks",
      "ProjectLocation": "Please Fill",
      "ChallengeSummary": "Ideating the concept of a genAI powered platform to document BOM (Documented Bills of Material) for a better experience.",
      "ParagraphContentList": [
        {
          "TitleText": "",
          "SubtitleText": "",
          "ImageLocation": "images/S3.1.png",
          "ContentText": "BOM comparison for executives to assess differences in BOM",
          "Layout": "column"
        },
        {
          "TitleText": "",
          "SubtitleText": "",
          "ImageLocation": "images/S3.2.png",
          "ContentText": "Actions when comparing BOM",
          "Layout": "column"
        },
        {
          "TitleText": "",
          "SubtitleText": "",
          "ImageLocation": "images/S3.3.png",
          "ContentText": "Chronological tracking of a specific part thanks to other Gen AI features",
          "Layout": "column"
        }
      ]
    }
  ]
}